cleanli2/stm32/src/cmd.c
}
void rtcs(char *p)
{
    (void)p;
    con_send('\n');
    if(RTC_OK==adjust_1min(0)){
        lprintf("slower 1 min OK\n");
    }
    else{
        lprintf("slower 1 min FAIL\n");
    }
    return;
}
void rtcf(char *p)
{
    (void)p;
    con_send('\n');
    if(RTC_OK==adjust_1min(1)){
        lprintf("faster 1 min OK\n");
    }
    else{
        lprintf("faster 1 min FAIL\n");
    }
    return;
}
void gpiotest(char *p)
{
    (void)p;
    con_send('\n');
    gpio_test();

    return;

}

#ifdef DAC_SUPPORT
void dac(char *p)
{
    uint32_t tmp, data, type=1, para2=9;
    char*pbak, *para;
    tmp = get_howmany_para(p);
    lprintf("para number=%d\n", tmp);
    if(tmp<1){
        lprintf("err\ndac on/off/data");
        return;
    }
    pbak=p;
    if(tmp>=1){
        p = str_to_str(p, &para);
        lprintf("para:%s\n", para);
    }
    if(!strcmp(para, "on")){
        lprintf("dac on\n");
        Dac1_Init();
    }
    else if(!strcmp(para, "off")){
        lprintf("dac on\n");
        Dac1_DeInit();
    }
    else if(!strcmp(para, "freq")){
        if(tmp>=2){
            p = str_to_hex(p, &para2);
            lprintf("dac freq set %dHz\n", para2);
            dac_set_freq(para2);
        }
    }
    else if(!strcmp(para, "wave")){
        lprintf("dac wave\n");
        if(tmp>=2){
            p = str_to_hex(p, &type);
            if(type>3)type=1;
        }
        if(tmp>=3){
            p = str_to_hex(p, &para2);
        }
        if(3==type){
            int fd, ret, left_len, foffset=0;
            const char* fname="MUSIC", *ename="WAV";
            lprintf("fname:%s.%s\n", fname, ename);
            memset(filebuf, 0xff, 512);
            fd = open_file(SD_ReadBlock, fname, ename, &left_len);
            if(fd < 0){
                lprintf("file open fail %d\n", fd);
                return;
            }
            lprintf("file len %d\n", left_len);
            while(1){
                //lprintf_to("foff:%x\n", foffset);
                ret = read_file(fd, filebuf, foffset, 512);
                if(ret != FS_OK){
                    lprintf("sd file read fail\n");
                    close_file(fd);
                    return;
                }
                para2=(uint32_t)filebuf;
                Dac1_wave(type, para2);
                if(con_is_recved()){
                    close_file(fd);
                    return;
                }
                if(left_len>512){
                    left_len-=512;
                    foffset+=512;
                }
                else{
                    lprintf("file play done\n");
                    close_file(fd);
                    return;
                }
            }
        }
        else{
            while(!con_is_recved()){
                Dac1_wave(type, para2);
            }
        }
    }
    else{
        lprintf("set dac data %X\n", data);
        p = str_to_hex(pbak, &data);
        Dac1_Set_Vol(data);
    }
    con_send('\n');

    return;
}
#endif

void f2erm(char *p)
{
    int ret, left_len, foffset=0, fd;
    uint32_t tmp, eaddr;
    char* fname, *ename;
    tmp = get_howmany_para(p);
    lprintf("para number=%d\n", tmp);
    if(tmp<2){
        lprintf("err\nf2erm fname addr");
        return;
    }
    p = str_to_str(p, &fname);
    p = str_to_str(p, &ename);
    lprintf("fname:%s.%s\n", fname, ename);
    p = str_to_hex(p, &eaddr);
    lprintf("erom addr:%X\n", eaddr);
    memset(filebuf, 0xff, 512);
    fd = open_file(SD_ReadBlock, fname, ename, &left_len);
    if(fd < 0){
        lprintf("file open fail %d\n", fd);
        return;
    }
    lprintf("file len %d\n", left_len);
    while(left_len){
        memset(filebuf, 0xff, 512);
        lprintf("sd read offset: %X\n", foffset);
        ret = read_file(fd, filebuf, foffset, 512);
        if(ret != FS_OK){
            lprintf("sd file read fail\n");
            close_file(fd);
            return;
        }
        lprintf("ee write: %X\n", eaddr);
        SPI_Flash_Write_direct_erase((u8*)filebuf, eaddr, 512);
        if(left_len>512){
            left_len-=512;
            eaddr+=512;
            foffset+=512;
        }
        else{
            lprintf("file copy done\n");
            close_file(fd);
            return;
        }
    }
}

void rtc_cmd(char *p)
{
    uint8_t d[6], tmp;

    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp==6){
        p = str_to_hex(p, (uint*)&d[0]);
        p = str_to_hex(p, (uint*)&d[1]);
        p = str_to_hex(p, (uint*)&d[2]);
        p = str_to_hex(p, (uint*)&d[3]);
        p = str_to_hex(p, (uint*)&d[4]);
        p = str_to_hex(p, (uint*)&d[5]);
        rtc_write(d);
    }
    else if(tmp==0){
        lprintf("%s\n", get_rtc_time(0));
    }
    else if(tmp==1){
        p = str_to_hex(p, (uint*)&d[0]);
        if(d[0] == 0xff){
            rtc_dump_regs();
        }
        lprintf("read reg %b=%b\n", d[0], rtc_read_reg(d[0]));
    }
    else if(tmp==2){
        p = str_to_hex(p, (uint*)&d[0]);
        p = str_to_hex(p, (uint*)&d[1]);
        lprintf("write reg %b->%b\n", d[0], d[1]);
        rtc_write_reg(d[0], d[1]);
    }
    else{
        lprintf("error \n");
    }
    con_send('\n');

    return;

}
static const struct command cmd_list[]=
{
    //{"dwb",dispwb},
    {"adc",adc},
    {"bz",buzztest},
#ifdef DAC_SUPPORT
    {"dac",dac},
#endif
    {"exit",cmd_exit},
    {"envset",envset},
    {"envget",envget},
    {"envprint",envprint},
    {"f2erm",f2erm},
#ifndef WRITE_W25F
    {"fmerase",fmerase},
    {"fmrtest",fmrtest},
    {"fmwtest",fmwtest},
    {"go",go},
    {"gpiotest",gpiotest},
#endif
    {"help",print_help},
    {"history",history},
#ifndef WRITE_W25F
    //{"lcd19264init",lcd19264init},
    //{"lcd19264dc",dispcchar},
    {"kt",keytest},
    {"led",ledtest},
    {"logf",logflag},
    {"lst",lcdsuebinit},
    {"lstep",lcdsuebstep},
    {"lstest",lcdsuebtest},
#endif
    {"pm",print_mem},
    {"poff",poweroff},
    {"r",read_mem},
    {"reboot",reboot},
    {"rebootd",rebootd},
    {"rtc",rtc_cmd},
    {"rtcf",rtcf},
    {"rtcs",rtcs},
    {"sd",sd},
#ifndef WRITE_W25F
    //{"sdcmds",sd_cmds},
    {"test",test},
    {"taskmask",tm},
    //{"szk",show_ziku},
    //{"usb",usb_strg_init},
#endif
    {"w",write_mem},
    {"w25f",w25f},
    {NULL, NULL},
};
static uint32_t * mrw_addr;
void go(char *para)
{
    (void)para;
	(*((void (*)())mrw_addr))();
}

void print_help(char *para)
{
    (void)para;
    uint i = 0;
    lprintf("Version %s%s\n", VERSION, GIT_SHA1);
    lprint("Cmd:\n");
    while(1){
            if(cmd_list[i].cmd_name == NULL)
                    break;
	    lprint("--%s\n", cmd_list[i].cmd_name);
            i++;
    }
}

uint asc_to_hex(char c)
{
	if(c >= '0' && c <= '9')
		return c - '0';	
	if(c >= 'A' && c <= 'F')
		return c - 'A' + 10;
	if(c >= 'a' && c <= 'f')
		return c - 'a' + 10;
	return 0;
}

